# **Ejercicios de pair programming M√≥dulo 2 Sprint 2**
## **Limpieza: Lecci√≥n 5**
### **Valores nulos: Sklearn**

---

In [1]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import numpy as np
from sklearn.impute import SimpleImputer
from sklearn.experimental import enable_iterative_imputer
from sklearn.impute import IterativeImputer 
from sklearn.impute import KNNImputer

In [2]:
df_bank = pd.read_csv("data/bank-additional-full-procesado3.csv", index_col = 0)

In [3]:
df_bank.sample(3)

,age,job,marital,education,default,housing,loan,contact,duration,campaign,...,poutcome,"emp,var,rate","cons,price,idx","cons,conf,idx",euribor3m,"nr,employed",y,month_day_week,month,day
11282,34,services,married,basic 6y,No,No,No,telephone,722,1,...,NONEXISTENT,1.4,94.465,-41.8,4.961,5228.1,no,"['jun', 'thu']",'jun','thu'
37366,59,administration,divorced,professional course,No,No,No,telephone,198,1,...,NONEXISTENT,-2.9,92.201,-31.4,0.883,5076.2,no,"['aug', 'tue']",'aug','tue'
23292,44,technician,married,professional course,No,No,No,cellular,39,9,...,NONEXISTENT,1.4,93.444,-36.1,4.964,5228.1,no,"['aug', 'wed']",'aug','wed'

In [4]:
df_bank.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 41176 entries, 0 to 41187
Data columns (total 22 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             41176 non-null  int64
 1   job             40846 non-null  object
 2   marital         41096 non-null  object
 3   education       39446 non-null  object
 4   default         32580 non-null  object
 5   housing         40186 non-null  object
 6   loan            40186 non-null  object
 7   contact         41176 non-null  object
 8   duration        41176 non-null  int64
 9   campaign        41176 non-null  int64
 10  pdays           41176 non-null  int64
 11  previous        41176 non-null  int64
 12  poutcome        41176 non-null  object
 13  emp,var,rate    41176 non-null  float64
 14  cons,price,idx  41176 non-null  float64
 15  cons,conf,idx   41176 non-null  float64
 16  euribor3m       41176 non-null  float64
 17  nr,employed     41176 non-null  float64
 18  y               41176 non-null  object
 19  month_day_week  41176 non-null  object
 20  month           41176 non-null  object
 21  day             41176 non-null  object
dtypes: float64(5), int64(5), object(12)
memory usage: 7.2+ MB

1. Es el momento de eliminar los nulos:
- Reemplazad los valores nulos del resto de las columnas categ√≥ricas por la moda, usando el m√©todo SimpleImputer.
üí° Pista üí° La moda en este tipo de aproximaci√≥n se indica como most_frequent.

In [5]:
df_categoricas = df_bank.select_dtypes(include= 'object')

df_categoricas

,job,marital,education,default,housing,loan,contact,poutcome,y,month_day_week,month,day
0,housemaid,married,basic 4y,No,No,No,telephone,NONEXISTENT,no,"['may', 'mon']",'may','mon'
1,services,married,high school,NaN,No,No,telephone,NONEXISTENT,no,"['may', 'mon']",'may','mon'
2,services,married,high school,No,S√≠,No,telephone,NONEXISTENT,no,"['may', 'mon']",'may','mon'
3,administration,married,basic 6y,No,No,No,telephone,NONEXISTENT,no,"['may', 'mon']",'may','mon'
4,services,married,high school,No,No,S√≠,telephone,NONEXISTENT,no,"['may', 'mon']",'may','mon'
...,...,...,...,...,...,...,...,...,...,...,...,...
41183,retired,married,professional course,No,S√≠,No,cellular,NONEXISTENT,yes,"['nov', 'fri']",'nov','fri'
41184,blue-collar,married,professional course,No,No,No,cellular,NONEXISTENT,no,"['nov', 'fri']",'nov','fri'
41185,retired,married,university degree,No,S√≠,No,cellular,NONEXISTENT,no,"['nov', 'fri']",'nov','fri'
41186,technician,married,professional course,No,No,No,cellular,NONEXISTENT,yes,"['nov', 'fri']",'nov','fri'
41187,retired,married,professional course,No,S√≠,No,cellular,FAILURE,no,"['nov', 'fri']",'nov','fri'

In [6]:
imputer = SimpleImputer(strategy= 'most_frequent', missing_values= np.nan)
imputer = imputer.fit(df_categoricas)

In [7]:
df_categoricas[['job', 'marital', 'education', 'default', 'housing', 'loan', 'contact',
       'poutcome', 'y', 'month_day_week', 'month', 'day']] = imputer.transform(df_categoricas[['job', 'marital', 'education', 'default', 'housing', 'loan', 'contact',
       'poutcome', 'y', 'month_day_week', 'month', 'day']])

In [8]:
df_categoricas.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 41176 entries, 0 to 41187
Data columns (total 12 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   job             41176 non-null  object
 1   marital         41176 non-null  object
 2   education       41176 non-null  object
 3   default         41176 non-null  object
 4   housing         41176 non-null  object
 5   loan            41176 non-null  object
 6   contact         41176 non-null  object
 7   poutcome        41176 non-null  object
 8   y               41176 non-null  object
 9   month_day_week  41176 non-null  object
 10  month           41176 non-null  object
 11  day             41176 non-null  object
dtypes: object(12)
memory usage: 4.1+ MB

In [9]:
columnas = df_categoricas.columns
df_bank.drop(columnas, axis= 1, inplace= True)
df_bank[columnas] = df_categoricas[columnas]

In [10]:
df_bank.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 41176 entries, 0 to 41187
Data columns (total 22 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             41176 non-null  int64
 1   duration        41176 non-null  int64
 2   campaign        41176 non-null  int64
 3   pdays           41176 non-null  int64
 4   previous        41176 non-null  int64
 5   emp,var,rate    41176 non-null  float64
 6   cons,price,idx  41176 non-null  float64
 7   cons,conf,idx   41176 non-null  float64
 8   euribor3m       41176 non-null  float64
 9   nr,employed     41176 non-null  float64
 10  job             41176 non-null  object
 11  marital         41176 non-null  object
 12  education       41176 non-null  object
 13  default         41176 non-null  object
 14  housing         41176 non-null  object
 15  loan            41176 non-null  object
 16  contact         41176 non-null  object
 17  poutcome        41176 non-null  object
 18  y               41176 non-null  object
 19  month_day_week  41176 non-null  object
 20  month           41176 non-null  object
 21  day             41176 non-null  object
dtypes: float64(5), int64(5), object(12)
memory usage: 7.2+ MB

- Utilizad el m√©todo Iterative Imputer para reemplazar todos los valores nulos de las columnas num√©ricas.

In [11]:
df_numericas = df_bank.select_dtypes(include= np.number)

df_numericas

,age,duration,campaign,pdays,previous,"emp,var,rate","cons,price,idx","cons,conf,idx",euribor3m,"nr,employed"
0,56,261,1,999,0,1.1,93.994,-36.4,4.857,5191.0
1,57,149,1,999,0,1.1,93.994,-36.4,4.857,5191.0
2,37,226,1,999,0,1.1,93.994,-36.4,4.857,5191.0
3,40,151,1,999,0,1.1,93.994,-36.4,4.857,5191.0
4,56,307,1,999,0,1.1,93.994,-36.4,4.857,5191.0
...,...,...,...,...,...,...,...,...,...,...
41183,73,334,1,999,0,-1.1,94.767,-50.8,1.028,4963.6
41184,46,383,1,999,0,-1.1,94.767,-50.8,1.028,4963.6
41185,56,189,2,999,0,-1.1,94.767,-50.8,1.028,4963.6
41186,44,442,1,999,0,-1.1,94.767,-50.8,1.028,4963.6
41187,74,239,3,999,1,-1.1,94.767,-50.8,1.028,4963.6

In [12]:
df_numericas.columns

Index(['age', 'duration', 'campaign', 'pdays', 'previous', 'emp,var,rate',
       'cons,price,idx', 'cons,conf,idx', 'euribor3m', 'nr,employed'],
      dtype='object')

In [13]:
imputer = IterativeImputer(n_nearest_features= None, imputation_order= 'ascending')
imputer = imputer.fit(df_numericas)

df_num_trans = pd.DataFrame(imputer.transform(df_numericas), columns= df_numericas.columns)

In [14]:
columnas_num = df_numericas.columns
df_bank.drop(columnas_num, axis= 1, inplace= True)
df_bank[columnas_num] = df_numericas[columnas_num]

- Reemplazad los valores nulos de la columna age por la media de la edad usando el m√©todo KNN Imputer.

In [20]:
imputerKNN_age = KNNImputer(n_neighbors=5)
imputerKNN_age.fit(df_numericas[['age']])
df_numericas['age']= imputerKNN_age.transform(df_numericas[['age']])

df_knn_imputer = pd.DataFrame(df_numericas, columns = df_numericas.columns)

In [22]:
df_knn_imputer

,age,duration,campaign,pdays,previous,"emp,var,rate","cons,price,idx","cons,conf,idx",euribor3m,"nr,employed"
0,56.0,261,1,999,0,1.1,93.994,-36.4,4.857,5191.0
1,57.0,149,1,999,0,1.1,93.994,-36.4,4.857,5191.0
2,37.0,226,1,999,0,1.1,93.994,-36.4,4.857,5191.0
3,40.0,151,1,999,0,1.1,93.994,-36.4,4.857,5191.0
4,56.0,307,1,999,0,1.1,93.994,-36.4,4.857,5191.0
...,...,...,...,...,...,...,...,...,...,...
41183,73.0,334,1,999,0,-1.1,94.767,-50.8,1.028,4963.6
41184,46.0,383,1,999,0,-1.1,94.767,-50.8,1.028,4963.6
41185,56.0,189,2,999,0,-1.1,94.767,-50.8,1.028,4963.6
41186,44.0,442,1,999,0,-1.1,94.767,-50.8,1.028,4963.6
41187,74.0,239,3,999,1,-1.1,94.767,-50.8,1.028,4963.6

In [24]:
columnas_knn = df_knn_imputer.columns
df_bank.drop(columnas_knn, axis = 1, inplace = True)
df_bank[columnas_knn] = df_numericas

In [25]:
df_bank.isnull().sum()

job               0
marital           0
education         0
default           0
housing           0
loan              0
contact           0
poutcome          0
y                 0
month_day_week    0
month             0
day               0
age               0
duration          0
campaign          0
pdays             0
previous          0
emp,var,rate      0
cons,price,idx    0
cons,conf,idx     0
euribor3m         0
nr,employed       0
dtype: int64

- Reemplazad los valores nulos de la columna age por la media de la edad usando el m√©todo Simple Imputer.

In [26]:
imputer = SimpleImputer(strategy='mean', missing_values=np.nan)
imputer = imputer.fit(df_bank[['age']])
df_bank['age_mean'] = imputer.transform(df_bank[['age']])
df_bank.isnull().sum()

job               0
marital           0
education         0
default           0
housing           0
loan              0
contact           0
poutcome          0
y                 0
month_day_week    0
month             0
day               0
age               0
duration          0
campaign          0
pdays             0
previous          0
emp,var,rate      0
cons,price,idx    0
cons,conf,idx     0
euribor3m         0
nr,employed       0
age_mean          0
dtype: int64

- ¬øPodr√≠ais explicar qu√© diferencia hay entre estos √∫ltimos tres ejercicios?

- El m√©todo SimpleImputer substitui los valores nuelos del DF o de la columna asingnada por un valor constante o un parametro estad√≠stico pasado (mean, median, most_freq(mode) o constant).
- El Iteractive Imputer es un imputador multivariable que estima cada valor nulo a partir de los valores de la mejor variable, o sea, por una relaci√≥n similar a la de la correlaci√≥n, estima la variable que se comporta de forma m√°s cercana al dato que se quiere reemplazar. Este imputador hace un modelado de cada caracter√≠stica de los valores perdidos en funci√≥n de las caracter√≠sticas de las dem√°s variables de forma iterativa. Es el imputador m√°s refinado, pero est√° en fase experiemental. 
- El KNN imputer analiza las distancias de los datos similares entre los valores m√°s cercanos al dato que se quer reemplazar y el algor√≠tmo toma la medida de dichos valores para la media.

2. Guardad el csv.